In [1]:
import numpy as np
import pandas as pd

# Data Wrangling: Clean, Transform, Merge, Reshape

- Much of the programming work in data analysis and modeling is spent on data preparation
    - loading, cleaning, transforming, and rearranging.
    -  the way that data is stored in files or databases is not the way you need it.
- Fortunately, pandas along with the Python standard library provide you with a high-level, flexible, and high-performance set of core manipulations and algorithms to enable you to wrangle data into the right form without much trouble.

## Hierarchical Indexing

- Hierarchical indexing  enables you to have multiple (two or more) index levels on an axis.

In [2]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -0.035613
   2    0.404407
   3   -0.469269
b  1    0.180829
   3    0.898972
c  1    0.654246
   2    0.603022
d  2    0.961749
   3   -1.713486
dtype: float64

In [3]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

- partial indexing

In [4]:
data["a"]

1   -0.035613
2    0.404407
3   -0.469269
dtype: float64

In [5]:
data["b"]

1    0.180829
3    0.898972
dtype: float64

In [6]:
data["b":"d"]

b  1    0.180829
   3    0.898972
c  1    0.654246
   2    0.603022
d  2    0.961749
   3   -1.713486
dtype: float64

In [7]:
data[["b","d"]]

b  1    0.180829
   3    0.898972
d  2    0.961749
   3   -1.713486
dtype: float64

In [8]:
data

a  1   -0.035613
   2    0.404407
   3   -0.469269
b  1    0.180829
   3    0.898972
c  1    0.654246
   2    0.603022
d  2    0.961749
   3   -1.713486
dtype: float64

In [9]:
data[:,3]

a   -0.469269
b    0.898972
d   -1.713486
dtype: float64

<img src="https://drive.google.com/uc?id=1e5Qd4sSQvwu-4lKQHpn8IEeDR4CVs_Ns" width="60%" allow="autoplay"></img>

In [10]:
data

a  1   -0.035613
   2    0.404407
   3   -0.469269
b  1    0.180829
   3    0.898972
c  1    0.654246
   2    0.603022
d  2    0.961749
   3   -1.713486
dtype: float64

In [11]:
data.unstack()

          1         2         3
a -0.035613  0.404407 -0.469269
b  0.180829       NaN  0.898972
c  0.654246  0.603022       NaN
d       NaN  0.961749 -1.713486

In [12]:
dataDF = data.unstack()
type(dataDF)

pandas.core.frame.DataFrame

In [13]:
dataDF.stack()

a  1   -0.035613
   2    0.404407
   3   -0.469269
b  1    0.180829
   3    0.898972
c  1    0.654246
   2    0.603022
d  2    0.961749
   3   -1.713486
dtype: float64

- In DataFrame, either axis can have a hierarchical index

In [14]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [15]:
frame.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [16]:
frame.columns

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           )

In [17]:
frame["Ohio"]

     Green  Red
a 1      0    1
  2      3    4
b 1      6    7
  2      9   10

In [18]:
frame.loc["a",:]

   Ohio     Colorado
  Green Red    Green
1     0   1        2
2     3   4        5

In [19]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [20]:
frame.sum(axis=1)

key1  key2
a     1        3
      2       12
b     1       21
      2       30
dtype: int64

## Database-style DataFrame Merges

- pandas.merge connects rows in DataFrames based on one or more keys.
- pandas.concat glues or stacks together objects along an axis.
- combine_first instance method enables splicing together overlapping data to fill in missing values in one object with values from another.

- Merge or join operations combine datasets by linking rows using one or more keys.
    - These operations are central to relational databases (e.g., SQL-based).

In [21]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})

In [22]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [23]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [24]:
pd.merge(df1, df2) # natural join

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [25]:
df1.merge(df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [26]:
pd.merge(df1, df2, on='key') # join using the attribute specified in the "on" parameter

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [27]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})

In [28]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [29]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [30]:
pd.merge(df3,df4)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [46]:
#we can specify the join attributes on the left and right tables
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

In [47]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey', how='left')

  lkey  data1 rkey  data2
0    b      0    b    1.0
1    b      1    b    1.0
2    a      2    a    0.0
3    c      3  NaN    NaN
4    a      4    a    0.0
5    a      5    a    0.0
6    b      6    b    1.0

In [48]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey', how='right')

  lkey  data1 rkey  data2
0    a    2.0    a      0
1    a    4.0    a      0
2    a    5.0    a      0
3    b    0.0    b      1
4    b    1.0    b      1
5    b    6.0    b      1
6  NaN    NaN    d      2

In [49]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey', how='outer')

  lkey  data1 rkey  data2
0    a    2.0    a    0.0
1    a    4.0    a    0.0
2    a    5.0    a    0.0
3    b    0.0    b    1.0
4    b    1.0    b    1.0
5    b    6.0    b    1.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

In [50]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})

In [51]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [52]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [53]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  bar  one   3.0   6.0
1  bar  two   NaN   7.0
2  foo  one   1.0   4.0
3  foo  one   1.0   5.0
4  foo  two   2.0   NaN

- treatment of overlapping column names.
-  merge has a suffixes option for specifying strings to append to overlapping names in the left and right DataFrame objects

In [54]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [55]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

- Merging on Index
    - the merge key(s) in a DataFrame can be found in its index.

In [56]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [57]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [58]:
right1

   group_val
a        3.5
b        7.0

In [59]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0

In [60]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [61]:
pd.merge(right1, right1, left_index=True, right_index=True)

   group_val_x  group_val_y
a          3.5          3.5
b          7.0          7.0

In [62]:
#we can use the indexes on both tables

left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['Ohio', 'Nevada'])
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['Missouri', 'Alabama'])

In [63]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [64]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [65]:
pd.merge(left2, right2, left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

- DataFrame has a convenient **join** instance for merging by index
 - It performs a left join on the join keys, exactly preserving the left frames row index

In [66]:
left2.join(right2)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [67]:
pd.merge(left2, right2, left_index=True, right_index=True, how= 'left')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [68]:
right2.join(left2)

   Missouri  Alabama  Ohio  Nevada
b       7.0      8.0   NaN     NaN
c       9.0     10.0   3.0     4.0
d      11.0     12.0   NaN     NaN
e      13.0     14.0   5.0     6.0

In [69]:
left2.join(right2, how='inner')

   Ohio  Nevada  Missouri  Alabama
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [70]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [71]:
right1

   group_val
a        3.5
b        7.0

In [72]:
# we can join by index and attribute as with the merge
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [73]:
#joining more tables
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                       index=['a', 'c', 'e', 'f'],
                       columns=['New York', 'Oregon'])
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [74]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

## Concatenating Along an Axis

- Another kind of data combination operation is referred to interchangeably as concatenation, binding, or stacking

In [75]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [76]:
np.concatenate([arr, arr])

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [77]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In the context of pandas objects such as Series and DataFrame, having labeled axes
enable you to further generalize array concatenation

In [78]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [79]:
s1

a    0
b    1
dtype: int64

In [80]:
s2

c    2
d    3
e    4
dtype: int64

In [81]:
s3

f    5
g    6
dtype: int64

In [82]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [83]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [84]:
s4 = pd.concat([s1, s3])

In [85]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [86]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [87]:
s1

a    0
b    1
dtype: int64

In [88]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [89]:
pd.concat([s1, s4], axis=1, join ='inner')

   0  1
a  0  0
b  1  1

- A potential issue is that the concatenated pieces are not identifiable in the result.

In [90]:
pd.concat([s1,s2,s3], keys=['s1','s2','s3'])

s1  a    0
    b    1
s2  c    2
    d    3
    e    4
s3  f    5
    g    6
dtype: int64

In [91]:
pd.concat([s1,s2,s3], keys=['s1','s2','s3']).unstack()

      a    b    c    d    e    f    g
s1  0.0  1.0  NaN  NaN  NaN  NaN  NaN
s2  NaN  NaN  2.0  3.0  4.0  NaN  NaN
s3  NaN  NaN  NaN  NaN  NaN  5.0  6.0

- The same logic extends to DataFrame objects:

In [92]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                   columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
                   columns=['three', 'four'])

In [93]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [94]:
df2

   three  four
a      5     6
c      7     8

In [95]:
pd.concat([df1,df2])

   one  two  three  four
a  0.0  1.0    NaN   NaN
b  2.0  3.0    NaN   NaN
c  4.0  5.0    NaN   NaN
a  NaN  NaN    5.0   6.0
c  NaN  NaN    7.0   8.0

In [96]:
pd.concat([df1,df2], axis=1)

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

In [97]:
pd.concat([df1,df2], axis=1, keys =['df1','df2'])

  df1       df2
  one two three four
a   0   1   5.0  6.0
b   2   3   NaN  NaN
c   4   5   7.0  8.0

- when the row index does not contain any relevant data

In [98]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [99]:
df1

          a         b         c         d
0 -0.466003  0.508205  1.588570 -1.452600
1 -0.938630  1.057730 -0.496168  0.242189
2 -0.915706  1.677679 -0.267075 -0.662579

In [100]:
df2

          b         d         a
0  0.897087 -0.963263 -0.289483
1  0.997313 -0.578474  0.418257

In [101]:
pd.concat([df1,df2])

          a         b         c         d
0 -0.466003  0.508205  1.588570 -1.452600
1 -0.938630  1.057730 -0.496168  0.242189
2 -0.915706  1.677679 -0.267075 -0.662579
0 -0.289483  0.897087       NaN -0.963263
1  0.418257  0.997313       NaN -0.578474

In [102]:
pd.concat([df1,df2], ignore_index=True)

          a         b         c         d
0 -0.466003  0.508205  1.588570 -1.452600
1 -0.938630  1.057730 -0.496168  0.242189
2 -0.915706  1.677679 -0.267075 -0.662579
3 -0.289483  0.897087       NaN -0.963263
4  0.418257  0.997313       NaN -0.578474

In [103]:
pd.concat([df1,df2], axis=1)

          a         b         c         d         b         d         a
0 -0.466003  0.508205  1.588570 -1.452600  0.897087 -0.963263 -0.289483
1 -0.938630  1.057730 -0.496168  0.242189  0.997313 -0.578474  0.418257
2 -0.915706  1.677679 -0.267075 -0.662579       NaN       NaN       NaN

# Data Aggregation and Group Operations

- Categorizing a dataset and applying a function to each group is often a critical component of a data analysis workflow.
- After loading, merging, and preparing a dataset, you may need to compute group statistics or pivot tables for reporting or visualization purposes.

### GroupBy Mechanics
- data contained in a pandas object is split into groups based on one or more keys.
    - The splitting is performed on a particular axis of an object.
        - For example, a DataFrame can be grouped on its rows (axis=0) or its columns (axis=1).
- a function is applied to each group, producing a new value.
- the results of all those function applications are combined into a result object.

<img src="https://drive.google.com/uc?id=1B559BfpzVoV6i9QdzmeA-GLrGdZTd-2s" width=500>

In [104]:
import pandas as pd
import numpy as np

In [105]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.156029 -2.922623
1    a  two -1.347749 -0.521902
2    b  one  1.317977 -0.744756
3    b  two -0.075676 -0.858273
4    a  one -0.343730 -0.134813

- We want to compute the mean of the data1 column using the labels from key1.

In [106]:
grouped = df['data1'].groupby(df['key1'])

In [107]:
grouped

- This grouped variable is now a GroupBy object.
- It has not actually computed anything yet except for some intermediate data about the group key df['key1'].
- The idea is that this object has all of the information needed to then apply some operation to each of the groups.

In [108]:
grouped.max()

key1
a   -0.343730
b    1.317977
Name: data1, dtype: float64

In [109]:
grouped.mean()

key1
a   -0.949169
b    0.621151
Name: data1, dtype: float64

In [110]:
grouped.sum()

key1
a   -2.847508
b    1.242301
Name: data1, dtype: float64

In [111]:
df['data1'].groupby([df['key1'], df['key2']]).mean()

key1  key2
a     one    -0.749879
      two    -1.347749
b     one     1.317977
      two    -0.075676
Name: data1, dtype: float64

In [112]:
df['data1'].groupby([df['key1'], df['key2']]).mean().unstack()

key2       one       two
key1
a    -0.749879 -1.347749
b     1.317977 -0.075676

In [113]:
df

  key1 key2     data1     data2
0    a  one -1.156029 -2.922623
1    a  two -1.347749 -0.521902
2    b  one  1.317977 -0.744756
3    b  two -0.075676 -0.858273
4    a  one -0.343730 -0.134813

In [114]:
df.groupby(df['key1']).mean()

TypeError: agg function failed [how->mean,dtype->object]

In [138]:
df.groupby(df['key1']).mean(numeric_only=True)

         data1     data2
key1
a    -0.949169 -1.193113
b     0.621151 -0.801514

- Note that there is no key2 column in the result.
    - df['key2'] is not numeric data

    
    
- the method size returns a Series containing group sizes

In [139]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

- Iterating Over Groups
    - The GroupBy object supports iteration,
    - It generates a sequence of 2-tuples containing the group name along with the chunk of data

In [140]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)
    print("\n\n")

a
  key1 key2     data1     data2
0    a  one -1.156029 -2.922623
1    a  two -1.347749 -0.521902
4    a  one -0.343730 -0.134813



b
  key1 key2     data1     data2
2    b  one  1.317977 -0.744756
3    b  two -0.075676 -0.858273

In [141]:
# multiple keys in the group by clause
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)
    print("\n\n")

('a', 'one')
  key1 key2     data1     data2
0    a  one -1.156029 -2.922623
4    a  one -0.343730 -0.134813



('a', 'two')
  key1 key2     data1     data2
1    a  two -1.347749 -0.521902



('b', 'one')
  key1 key2     data1     data2
2    b  one  1.317977 -0.744756



('b', 'two')
  key1 key2     data1     data2
3    b  two -0.075676 -0.858273

- By default groupby groups on axis=0, but you can group on any of the other axes.

In [142]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [143]:
df

  key1 key2     data1     data2
0    a  one -1.156029 -2.922623
1    a  two -1.347749 -0.521902
2    b  one  1.317977 -0.744756
3    b  two -0.075676 -0.858273
4    a  one -0.343730 -0.134813

In [144]:
grouped = df.groupby(df.dtypes, axis=1)

/tmp/ipykernel_10706/521057107.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  grouped = df.groupby(df.dtypes, axis=1)

In [146]:
grouped

In [147]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -1.156029 -2.922623
1 -1.347749 -0.521902
2  1.317977 -0.744756
3 -0.075676 -0.858273
4 -0.343730 -0.134813
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

### Selecting a Column or Subset of Columns
- Indexing a GroupBy object created from a DataFrame with a column name or array of column names has the effect of column subsetting for aggregation

In [148]:
df.groupby('key1')['data1']
# it is equal to df['data1'].groupby(df['key1'])

In [149]:
df.groupby('key1')[['data2']]
# it is equal to df[['data2']].groupby(df['key1'])

In [150]:
df.groupby('key1')['data2'].mean()

key1
a   -1.193113
b   -0.801514
Name: data2, dtype: float64

### Grouping with Dicts and Series

In [151]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [152]:
people

               a         b         c         d         e
Joe    -0.511810 -0.519168 -0.219646  1.138976 -1.714172
Steve   0.387653 -0.983648 -0.529980 -1.076098  0.175717
Wes    -0.776727  0.511001  0.032650  0.482904 -0.004471
Jim     0.841507 -0.916368  1.486178 -1.414343  0.590121
Travis -0.009639  1.792728  1.048402 -0.179629 -1.143710

In [153]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'orange'}

In [154]:
by_column = people.groupby(mapping, axis=1)

/tmp/ipykernel_10706/3111365124.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  by_column = people.groupby(mapping, axis=1)

In [155]:
by_column.sum()

            blue    orange       red
Joe     0.919330 -1.714172 -1.030978
Steve  -1.606078  0.175717 -0.595995
Wes     0.515554 -0.004471 -0.265726
Jim     0.071835  0.590121 -0.074861
Travis  0.868773 -1.143710  1.783089

- The same functionality holds for Series, which can be viewed as a fixed-size mapping

In [156]:
map_series = pd.Series(mapping)

In [157]:
map_series

a       red
b       red
c      blue
d      blue
e    orange
dtype: object

In [158]:
by_columnSeries = people.groupby(map_series, axis=1)

/tmp/ipykernel_10706/3304494313.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  by_columnSeries = people.groupby(map_series, axis=1)

In [159]:
by_columnSeries.mean()

            blue    orange       red
Joe     0.459665 -1.714172 -0.515489
Steve  -0.803039  0.175717 -0.297997
Wes     0.257777 -0.004471 -0.132863
Jim     0.035918  0.590121 -0.037430
Travis  0.434386 -1.143710  0.891544

### Grouping with Functions
- Any function passed as a group key will be called once per index value, with the return values being used as the group names.

In [160]:
people

               a         b         c         d         e
Joe    -0.511810 -0.519168 -0.219646  1.138976 -1.714172
Steve   0.387653 -0.983648 -0.529980 -1.076098  0.175717
Wes    -0.776727  0.511001  0.032650  0.482904 -0.004471
Jim     0.841507 -0.916368  1.486178 -1.414343  0.590121
Travis -0.009639  1.792728  1.048402 -0.179629 -1.143710

In [161]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.447029 -0.924535  1.299181  0.207538 -1.128522
5  0.387653 -0.983648 -0.529980 -1.076098  0.175717
6 -0.009639  1.792728  1.048402 -0.179629 -1.143710

In [162]:
def name_with_j(x):
  if x.startswith("J"):
    return True
  return False

In [163]:
name_with_j("Jim")

True

In [164]:
name_with_j("Albert")

False

In [165]:
people.groupby(name_with_j).sum()

              a         b         c         d         e
False -0.398713  1.320081  0.551072 -0.772823 -0.972465
True   0.329698 -1.435536  1.266531 -0.275366 -1.124051

- Mixing functions with arrays, dicts, or Series is not a problem

In [166]:
people

               a         b         c         d         e
Joe    -0.511810 -0.519168 -0.219646  1.138976 -1.714172
Steve   0.387653 -0.983648 -0.529980 -1.076098  0.175717
Wes    -0.776727  0.511001  0.032650  0.482904 -0.004471
Jim     0.841507 -0.916368  1.486178 -1.414343  0.590121
Travis -0.009639  1.792728  1.048402 -0.179629 -1.143710

In [115]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()

NameError: name 'people' is not defined

### Data Aggregation

<img src="https://drive.google.com/uc?id=1Azj6fJq9KLaSZoA0GSLl2OwJCUzw-Ba2" width=500>

- Aggregations refer to any data transformation that produces scalar values from arrays.

- Many common aggregations, such as those found in the above table, have optimized implementations.

- You are not limited to only this set of methods.
    - For example quantile is not explicitly implemented for GroupBy, it is a Series method and thus available for use.

In [167]:
grouped = df.groupby('key1')
grouped['data1'].quantile()

key1
a   -1.156029
b    0.621151
Name: data1, dtype: float64

-  you can implement a custom function
- you have to pass the function to the agg() method

In [168]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [169]:
grouped = df.groupby('key1')

In [170]:
grouped['data1'].agg(peak_to_peak)

key1
a    1.004019
b    1.393653
Name: data1, dtype: float64

In [171]:
#Note that the method describes works applied to groups
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.949169  0.533016 -1.347749 -1.251889 -1.156029 -0.749879
b      2.0  0.621151  0.985462 -0.075676  0.272737  0.621151  0.969564

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a    -0.343730   3.0 -1.193113  1.510253 -2.922623 -1.722263 -0.521902
b     1.317977   2.0 -0.801514  0.080268 -0.858273 -0.829893 -0.801514


           75%       max
key1
a    -0.328358 -0.134813
b    -0.773135 -0.744756

## [BONUS] Column-Wise and Multiple Function Application

In [176]:
#caricare il file su colab
tips = pd.read_csv('data/tips.csv')

In [178]:
tips.head(10)

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4
5       25.29  4.71     No  Sun  Dinner     4
6        8.77  2.00     No  Sun  Dinner     2
7       26.88  3.12     No  Sun  Dinner     4
8       15.04  1.96     No  Sun  Dinner     2
9       14.78  3.23     No  Sun  Dinner     2

In [179]:
tips.shape

(244, 6)

In [180]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [181]:
tips.head(10)

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240
6        8.77  2.00     No  Sun  Dinner     2  0.228050
7       26.88  3.12     No  Sun  Dinner     4  0.116071
8       15.04  1.96     No  Sun  Dinner     2  0.130319
9       14.78  3.23     No  Sun  Dinner     2  0.218539

- aggregating a Series or all of the columns of a DataFrame is a matter of using aggregate with the desired function or calling a method like mean or std.
- you may want to aggregate using a different function depending on the column, or multiple functions at once.

In [182]:
#this is a simple grouping
grouped = tips.groupby(['day', 'smoker'])

In [183]:
grouped_pct = grouped['tip_pct']

In [184]:
# for simple statistics, you can pass the name of the function as a string
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [185]:
grouped_pct.mean()

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [186]:
# If you pass a list of functions or function names, you get back a DataFrame with column names taken from the functions
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [187]:
grouped_pct.agg([('Media', 'mean'), ('Deviazione std', np.std)])

/tmp/ipykernel_10706/2786537713.py:1: FutureWarning: The provided callable <function std at 0x726608b32520> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  grouped_pct.agg([('Media', 'mean'), ('Deviazione std', np.std)])

                Media  Deviazione std
day  smoker
Fri  No      0.151650        0.028123
     Yes     0.174783        0.051293
Sat  No      0.158048        0.039767
     Yes     0.147906        0.061375
Sun  No      0.160113        0.042347
     Yes     0.187250        0.154134
Thur No      0.160298        0.038774
     Yes     0.163863        0.039389

In [188]:
#you can specify a list of functions to apply to all of the columns or different functions per column
#all columns
functions = ['count', 'mean', 'max']

In [189]:
grouped[['tip_pct', 'total_bill']].agg(functions)

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [190]:
#aggregation on a selection of the columns

In [191]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

/tmp/ipykernel_10706/683326323.py:1: FutureWarning: The provided callable <function max at 0x726608b319e0> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  grouped.agg({'tip' : np.max, 'size' : 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

## [BONUS] Apply: General split-apply-combine

- We want to select the top five values by group

In [192]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [193]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [194]:
tips[["day","total_bill"]].groupby(["day"]).max()

      total_bill
day
Fri        40.17
Sat        50.81
Sun        48.17
Thur       43.11

In [195]:
tips[["day","total_bill"]].groupby("day").apply(top, column="total_bill")

/tmp/ipykernel_10706/3809692214.py:1: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips[["day","total_bill"]].groupby("day").apply(top, column="total_bill")

           day  total_bill
day
Fri  91    Fri       22.49
     94    Fri       22.75
     96    Fri       27.28
     90    Fri       28.97
     95    Fri       40.17
Sat  23    Sat       39.42
     102   Sat       44.30
     59    Sat       48.27
     212   Sat       48.33
     170   Sat       50.81
Sun  11    Sun       35.26
     112   Sun       38.07
     184   Sun       40.55
     182   Sun       45.35
     156   Sun       48.17
Thur 83   Thur       32.68
     141  Thur       34.30
     85   Thur       34.83
     142  Thur       41.19
     197  Thur       43.11

In [196]:
tips[["day","total_bill"]].groupby("day").apply(top, n=1, column="total_bill")

/tmp/ipykernel_10706/223960879.py:1: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips[["day","total_bill"]].groupby("day").apply(top, n=1, column="total_bill")

           day  total_bill
day
Fri  95    Fri       40.17
Sat  170   Sat       50.81
Sun  156   Sun       48.17
Thur 197  Thur       43.11

## Pivot Tables

- A pivot table
    - aggregates a table of data by one or more keys,
    - arranges the data in a rectangle with some of the group keys along the rows and the columns.

In [208]:
#caricare il file su colab
tips = pd.read_csv('data/tips.csv')

In [209]:
tips.head(10)

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4
5       25.29  4.71     No  Sun  Dinner     4
6        8.77  2.00     No  Sun  Dinner     2
7       26.88  3.12     No  Sun  Dinner     4
8       15.04  1.96     No  Sun  Dinner     2
9       14.78  3.23     No  Sun  Dinner     2

In [ ]:
tips.pivot_table(index=['day', 'smoker']) # the default aggregation type is mean
# it raise error because among data used to compute mean there is also "time", which is not numerical

TypeError: agg function failed [how->mean,dtype->object]

In [206]:
tips.pivot_table(index=['day', 'smoker'], aggfunc='first')

             size    time   tip  total_bill
day  smoker
Fri  No         2  Dinner  3.50       22.49
     Yes        2  Dinner  3.00       28.97
Sat  No         3  Dinner  3.35       20.65
     Yes        4  Dinner  3.00       38.01
Sun  No         2  Dinner  1.01       16.99
     Yes        2  Dinner  3.00       17.51
Thur No         4   Lunch  4.00       27.20
     Yes        2   Lunch  3.00       19.44

In [ ]:
tips.pivot_table(index=['day', 'smoker'], values=['size', 'tip'], aggfunc='sum')

             size     tip
day  smoker
Fri  No         9   11.25
     Yes       31   40.71
Sat  No       115  139.63
     Yes      104  120.77
Sun  No       167  180.57
     Yes       49   66.82
Thur No       112  120.32
     Yes       40   51.51

In [201]:
tips.pivot_table(index=['day', 'size'], values='tip', columns='smoker')

smoker           No       Yes
day  size
Fri  1          NaN  1.920000
     2     2.750000  2.620000
     3     3.000000       NaN
     4          NaN  4.730000
Sat  1     1.000000  1.000000
     2     2.563200  2.476786
     3     3.412500  4.568333
     4     4.800000  3.335000
     5          NaN  3.000000
Sun  2     2.582222  3.345000
     3     2.937273  3.625000
     4     3.962500  5.090000
     5     5.070000  2.000000
     6     5.000000       NaN
Thur 1     1.830000       NaN
     2     2.341714  2.713846
     3     1.770000  3.615000
     4     4.030000  4.500000
     5     5.000000       NaN
     6     5.300000       NaN

In [ ]:
tips.pivot_table(index=['day', 'size'], values='tip', columns='smoker', margins=True) # margins=True adds a mean computed between values of columns for each row

smoker           No       Yes       All
day  size
Fri  1          NaN  1.920000  1.920000
     2     2.750000  2.620000  2.644375
     3     3.000000       NaN  3.000000
     4          NaN  4.730000  4.730000
Sat  1     1.000000  1.000000  1.000000
     2     2.563200  2.476786  2.517547
     3     3.412500  4.568333  3.797778
     4     4.800000  3.335000  4.123846
     5          NaN  3.000000  3.000000
Sun  2     2.582222  3.345000  2.816923
     3     2.937273  3.625000  3.120667
     4     3.962500  5.090000  4.087778
     5     5.070000  2.000000  4.046667
     6     5.000000       NaN  5.000000
Thur 1     1.830000       NaN  1.830000
     2     2.341714  2.713846  2.442500
     3     1.770000  3.615000  2.692500
     4     4.030000  4.500000  4.218000
     5     5.000000       NaN  5.000000
     6     5.300000       NaN  5.300000
All        2.991854  3.008710  2.998279

In [203]:
tips.pivot_table(index=['day', 'size'], values='tip', columns='smoker', margins=True, fill_value=-1000)

smoker              No          Yes       All
day  size
Fri  1    -1000.000000     1.920000  1.920000
     2        2.750000     2.620000  2.644375
     3        3.000000 -1000.000000  3.000000
     4    -1000.000000     4.730000  4.730000
Sat  1        1.000000     1.000000  1.000000
     2        2.563200     2.476786  2.517547
     3        3.412500     4.568333  3.797778
     4        4.800000     3.335000  4.123846
     5    -1000.000000     3.000000  3.000000
Sun  2        2.582222     3.345000  2.816923
     3        2.937273     3.625000  3.120667
     4        3.962500     5.090000  4.087778
     5        5.070000     2.000000  4.046667
     6        5.000000 -1000.000000  5.000000
Thur 1        1.830000 -1000.000000  1.830000
     2        2.341714     2.713846  2.442500
     3        1.770000     3.615000  2.692500
     4        4.030000     4.500000  4.218000
     5        5.000000 -1000.000000  5.000000
     6        5.300000 -1000.000000  5.300000
All           2.991854     3.008710  2.998279

## [Bonus] Cross-Tabulations: Crosstab
- A cross-tabulation (or crosstab for short) is a special case of a pivot table that computes group frequencies.

In [132]:
states= ['USA','USA','UK','IT','UK','UK','IT','USA']
gender= ['M','F','F','M','M','M','F','M']

In [133]:
data = pd.DataFrame({'states':states,'gender':gender})

In [134]:
data

  states gender
0    USA      M
1    USA      F
2     UK      F
3     IT      M
4     UK      M
5     UK      M
6     IT      F
7    USA      M

In [135]:
pd.crosstab(data.states, data.gender)

gender  F  M
states
IT      1  1
UK      1  2
USA     1  2

In [136]:
pd.crosstab(data.gender, data.states)

states  IT  UK  USA
gender
F        1   1    1
M        1   2    2

In [137]:
pd.crosstab(data.gender, data.states, margins=True)

states  IT  UK  USA  All
gender
F        1   1    1    3
M        1   2    2    5
All      2   3    3    8